# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArray..::..Item Property
FormArray Class See Also
---
Gets or sets a form at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Form this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As Form
	Get
	Set
```

Visual C++
---
```text
public:
virtual property Form^ Item[int index] {
	Form^ get (int index);
	void set (int index, Form^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the form to be set or retrieved.
# ### Return Value
Returns the form at the specified index.
# See Also
FormArray Class
Autodesk.Revit.DB Namespace